[
  "obsidian-excalidraw-plugin",
  "calendar",
  "recent-files-obsidian",
  "dashboard-navigator",
  "homepage",
  "obsidian-html-tags-autocomplete",
  "obsidian-image-toolkit",
  "templater-obsidian",
  "editing-toolbar",
  "obsidian-style-settings",
  "3d-graph",
  "iconic"
]