acpica
alacritty
alsa-firmware
alsa-plugins
alsa-utils
antlr4
archlinux-keyring
ark
b43-fwcutter
base
base-devel
bash-completion
bat
bind
bluedevil
blueman
bluez
bluez-utils
brave-bin
breeze-gtk
btrfs-progs
cantarell-fonts
cdrtools
chess-tui
chromium
clash-verge-rev-bin
cmatrix
code
cowsay
cryptsetup
cups
device-mapper
dialog
diffutils
dmidecode
dmraid
dnsch
dnsmasq
docker
dolphin
dolphin-plugins
dosfstools
downgrade
dracut
drawio-desktop
duf
e2fsprogs
efibootmgr
efitools
endeavouros-branding
endeavouros-keyring
endeavouros-mirrorlist
eos-apps-info
eos-breeze-sddm
eos-hooks
eos-log-tool
eos-packagelist
eos-quickstart
eos-rankmirrors
eos-settings-plasma
ethtool
exfatprogs
eza
f2fs-tools
fakeroot
fastfetch
ffmpegthumbnailer
ffmpegthumbs
figlet
filelight
firefox
firewalld
flatpak
freetype2
fuseiso
fwupd
gamemode
ghostwriter
gifsicle
gimp
git
gitkraken
glances
gnome-disk-utility
gparted
gpm
gptfdisk
grub
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
gtk2
gwenview
haruna
haveged
hiddify-next-bin
htop
hwdetect
hwinfo
inetutils
intel-ucode
inxi
iptables-nft
iwd
jcal
jdk17-openjdk
jfsutils
jre-openjdk
jre8-openjdk
jupyter-notebook
kate
kcalc
kde-cli-tools
kde-gtk-config
kdegraphics-thumbnailers
kdenetwork-filesharing
kdeplasma-addons
kernel-headers-musl
kernel-install-for-dracut
kgamma
kimageformats
kinfocenter
kio-admin
kio-extras
kio-fuse
konsole
kscreen
kwallet-pam
kwayland-integration
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-glew
lib32-libpulse
lib32-libsamplerate
lib32-nvidia-utils
lib32-portaudio
lib32-vulkan-icd-loader
libappindicator-gtk3
libdvdcss
libgsf
libguestfs
libopenraw
libreoffice-still
libstdc++5
linux
linux-firmware
linux-firmware-marvell
linux-headers
lmstudio
logrotate
lsb-release
lsscsi
lvm2
maliit-keyboard
man-db
man-pages
mdadm
megasync
meld
mesa
mesa-utils
minecraft-launcher
mkinitcpio-nfs-utils
modemmanager
mtools
multitail
musl
nano
nano-syntax-highlighting
nasm
nbd
ncdu
ndisc6
neofetch
neovim
net-tools
netctl
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
nss-mdns
ntfs-3g
ntp
nvidia
nvidia-inst
nvidia-prime
nvidia-settings
nvidia-utils
obs-studio
obsidian-bin
okular
oneko
openconnect
openvpn
optimus-manager-qt
optipng
os-prober
pacman-contrib
pamac-aur
papirus-folders-catppuccin-git
paru
pavucontrol
pdftk
perl
perl-file-mimeinfo
pipes.sh
pipewire-alsa
pipewire-pulse
pkgfile
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-nm
plasma-pa
plasma-systemmonitor
plasma-workspace
plasma-x11-session
playerctl
plocate
poppler-glib
power-profiles-daemon
powerdevil
powerline-fonts
powertop
ppp
pptpclient
print-manager
pulseaudio-alsa
pv
pyenv
python-capng
python-packaging
python-pip
python-pipx
python-pyqt5
qt5-quickcontrols
ranger
rebuild-detector
reflector
reflector-simple
reiserfsprogs
rp-pppoe
rsync
rtkit
s-nail
sddm-kcm
sfml
sfml2
sg3_utils
sl
smartmontools
sof-firmware
spectacle
sqlitebrowser
sqlmap
sudo
sysfsutils
system-config-printer
systemd-sysvcompat
telegram-desktop
tesseract
tesseract-data-eng
testdisk
texinfo
thunderbird
tk
tldr
tmux
touchegg
traceroute
tree
ttf-bitstream-vera
ttf-dejavu
ttf-liberation
ttf-opensans
ueberzug
unrar
unzip
usb_modeswitch
usbutils
valgrind
vi
virtualbox
virtualbox-sdk
vpnc
welcome
wget
which
whois
wine
wine-gecko
wine-mono
winetricks
wireless-regdb
wireplumber
wpa_supplicant
xautomation
xbindkeys
xclip
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-qxl
xf86-video-vesa
xfsprogs
xl2tpd
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-smproxy
xorg-x11perf
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xrandr
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xsettingsd
xwaylandvideobridge
xz
yay
zathura
zathura-pdf-mupdf
zip
